a = [1, 2, 3]
b = ["abc", 4, 5]
c = a + b # 두 개의 리스트를 붙여서 c에 저장
print(c)  # [1, 2, 3, "abc", 4, 5]

a = [1, 2]
b = a * 4
print(b)      # [1, 2, 1, 2, 1, 2, 1, 2]

print()
a = [1, 2, 3, "abc"] 
a[1:2] = ['g', 'h'] # [1, 'g', 'h', 3, "abc"]
print(a)
a[2:4] = ["ab", 'a', "def"]   
# [1, 'g', "ab", 'a', "def", "abc"]
print(a)
print()

a = [1, 2, 3, "abc", 'g', 'h'] 
a[1:2] = [] # [1, 3, "abc", 'g', 'h']
print(a)
a[2:4] = [] # [1, 3, 'h']
print(a)
del(a[0:2]) # ['h']
print(a)
print()

a = [1, 3, 5, 7, 9, 7, 5, 3, 1]
a.remove(5)   # [1, 3, 7, 9, 7, 5, 3, 1]
a.remove(3)   # [1, 7, 9, 7, 5, 3, 1]
a.remove(3)   # [1, 7, 9, 7, 5, 1]

'''
리스트의 요소를 제거하려면 remove(x) 활용
리스트에서 첫 번째로 나오는 x 제거
'''

a = [1, 5, 7, 5, 7, 5, 3, 1]
a.count(5)            # 3
a.count(3)            # 1
a.count(7)            # 2

a = [4, 8, 7, 2, 1] 
8 in a         # True
9 in a         # False

a = [4, 8, 7, 2, 1] 
a.index(8)         # 1
a.index(1)         # 4

a = [4, 8, 7, 2, 1] 
a.insert(2, 5)  # [4, 8, 5, 7, 2, 1]
a.insert(1, [1, 6])
# [4, [1, 6], 8, 5, 7, 2, 1]

a = [4, 8, 7, 2, 1] 
a.sort()      # [1, 2, 4, 7, 8]
a.append('a') # [1, 2, 4, 7, 8, 'a']
# a.sort() # Error 발생: 문자열과 정수를 비교함
b = ['g', 'o', 'o', 'd']
b.sort()      # ['d', 'g', 'o', 'o']

a = [4, 8, 7, 2, 1] 
a.reverse()           # [1, 2, 7, 8, 4]

()   # 빈 튜플(empty tuple)
(1, 2, 3, "abc") # 요소가 4개인 튜플
(1, 2, 3, (1, 2)) # 요소에 튜플 포함 가능 
(1, 2, 3, [1, 2]) # 요소에 리스트 포함 가능, 리스트도 요소에 튜플 포함 가능
tuple1 = (2, 3)
tuple2 = 2, 3    # 괄호 생략 가능
tuple3 = 2, 3, [1, 2], (1, 2)

tuple1 = (2,)       # 튜플 생성
tuple2 = 2,         # 튜플 생성
tuple3 = ("hello",) # 튜플
tuple4 = "hello",   # 튜플
tuple5 = (2)        # 정수
tuple6 = ("hello")  # 문자열

e = ()
t1 = (1, 2, 3, "abc")
t2 = (1, 2, 3, (1, 2)) 
t3 = 1, 2, 3, [1, 2], (1, 2)
len(())   # 0
len(e)
len(t1)
len(t2)
len((1, 2, 3, "abc"))
len((1, 2, 3, [1, 2]))

a = (1, 2, 3, "abc", 4, 5)
a[2:5:2]    # (3, 4)
a[2:6:2]    # (3, 4)
a[:3:2]     # (1, 3)
a[2::2]     # (3, 4)

t1 = (1, 2, 3)
t2 = ("abc", 4, 5)
t = t1 + t2 # 두 개 튜플을 붙여서 t에 저장
print(t)  # (1, 2, 3, "abc", 4, 5)

a = (1, 2)
b = a * 4
print(b)      # (1, 2, 1, 2, 1, 2, 1, 2)

t = (1, 2, [1, 2])
# t[1] = 3  #  오류 발생
# t[2] = [1, 3] #  오류 발생
# del(t[1]) #  오류 발생
# t.remove(1) #  오류 발생

list1 = t[2]
list1[0] = 3
t[2][0] = 4 # 튜플 안에 리스트를 변경하는 거므로 가능 !
print(t)





